Repository: drapatzc/toolbox
Catalog: Localizable.xcstrings
Source language: en
Languages: de

# nesting_depth_hint
source: Deep nesting reduces readability and testability
de: Tiefe Verschachtelung erschwert Lesbarkeit und Testbarkeit

source: network calls
de: Netzwerk-Aufrufe

source: never throws — unnecessarily marked
de: wirft nie — unnötig markiert

source: never updates
de: updatet nie

source: New build number
de: Neue Build-Nummer

source: New files exported:
de: Neue Dateien exportiert:

source: New marketing version (e.g. 2.1.0)
de: Neue Marketing-Version (z.B. 2.1.0)

source: Newly exported files
de: Neu exportierte Dateien

source: nm sorted by size
de: nm nach Größe sortiert

source: No accessibility annotations found
de: Keine Accessibility-Annotierungen gefunden

source: No .app found.
de: Keine .app gefunden.

source: No .app found in build folder.
de: Keine .app im Build-Ordner gefunden.

source: No AppIcon.appiconset found.
de: Kein AppIcon.appiconset gefunden.

source: No Base.lproj/Localizable.strings found.
de: Keine Base.lproj/Localizable.strings gefunden.

source: No binary found.
de: Kein Binary gefunden.

# no_build_has_been_performed_via_this_tool_yet_or
source: No build has been performed via this tool yet or DerivedData was deleted.
de: Es wurde noch kein Build über dieses Tool durchgeführt oder DerivedData wurde gelöscht.

source: No build warnings found.
de: Keine Build-Warnungen gefunden.

source: No built app found in DerivedData.
de: Keine gebaute App in DerivedData gefunden.

source: No changed files since last commit.
de: Keine geänderten Dateien seit letztem Commit.

# no_commits_by_var_found
source: No commits by '%@' found.
de: Keine Commits von '%@' gefunden.

# no_commits_by_var_found_in_period_var
source: No commits by "%@" found in period "%@".
de: Keine Commits von "%@" im Zeitraum "%@" gefunden.

# no_commits_for_line_range
source: No commits found for this line range — file may not be tracked in git history
de: Keine Commits für diesen Zeilenbereich gefunden — Datei möglicherweise nicht in Git-History

# no_commits_touching_swift_files
source: No commits with Swift file changes found
de: Keine Commits mit Swift-Datei-Änderungen gefunden

# no_commits_touching_xcodeproj
source: No commits with .xcodeproj changes found
de: Keine Commits mit .xcodeproj-Änderungen gefunden

# no_commits_with_var_found
source: No commits with '\(query)' found.
de: Keine Commits mit '\(query)' gefunden.

source: No conflict markers.
de: Keine Konflikt-Marker.

source: No crash logs found.
de: Keine Crash-Logs gefunden.

source: No debug print() calls
de: Keine Debug-print() Aufrufe

source: No dependency files found.
de: Keine Abhängigkeits-Dateien gefunden.

source: No device selected.
de: Kein Device gewählt.

source: No device selected — generic Simulator app opened.
de: Kein Device gewählt — generische Simulator-App geöffnet.

source: No devices found.
de: Keine Geräte gefunden.

source: No direct cycles detected (heuristic analysis).
de: Keine direkten Zyklen erkannt (Heuristik-Analyse).

source: No .docc catalogs found.
de: Keine .docc Kataloge gefunden.

# no_documentation_in_deriveddata
source: No generated documentation found in DerivedData.
de: Keine generierte Dokumentation in DerivedData gefunden.

source: No .dSYM found.
de: Kein .dSYM gefunden.

source: No duplicate keys found.
de: Keine doppelten Keys gefunden.

source: No expired signing certificates found.
de: Keine abgelaufenen Signing-Zertifikate gefunden.

# no_files_or_dirs
source: No entries available
de: Keine Einträge vorhanden

source: No force unwraps (!)
de: Keine Force-Unwraps (!)

# no_force_unwraps_2
source: No force-unwraps.
de: Keine Force-Unwraps.

source: No Git repository.
de: Kein Git-Repository.

source: No Git repository in the current directory.
de: Kein Git-Repository im aktuellen Verzeichnis.

source: No help available for this section.
de: Für diesen Bereich ist noch keine Hilfe vorhanden.

source: no import in other file
de: kein Import in anderem File

source: No Info.plist found.
de: Keine Info.plist gefunden.

# no_known_apps_found
source: None of the known apps were found.
de: Keine der bekannten Apps wurde gefunden.

source: No launch asset found.
de: Kein Launch-Asset gefunden.

source: No Localizable.strings found.
de: Keine Localizable.strings gefunden.

# no_long_functions_found
source: No functions over 50 lines found.
de: Keine Funktionen über 50 Zeilen gefunden.

source: no longer needed
de: nicht mehr nötig

source: No merged branches found
de: Keine gemergten Branches gefunden

source: no new Build
de: kein neuer Build

# no_new_commits_since_var
source: No new commits since \(since).
de: Keine neuen Commits seit \(since).

source: No ObservableObject protocol needed
de: Kein ObservableObject-Protokoll nötig

source: No open TODO/FIXME/HACK
de: Keine offenen TODO/FIXME/HACK

# no_package_resolved
source: No Package.resolved found
de: Kein Package.resolved gefunden

source: No Package.resolved found.
de: Keine Package.resolved gefunden.

# no_package_swift
source: No Package.swift found
de: Kein Package.swift gefunden

source: no Package.swift / Podfile / Cartfile
de: kein Package.swift / Podfile / Cartfile

source: No .pbxproj found.
de: Keine .pbxproj gefunden.

source: No project.
de: Kein Projekt.

source: No project found.
de: Kein Projekt gefunden.

source: No property wrappers found
de: Keine Property Wrapper gefunden

source: No provisioning profile folder found.
de: Kein Provisioning Profile Ordner gefunden.

source: No provisioning profiles found.
de: Keine Provisioning Profiles gefunden.

source: No @Published needed — all properties automatically observable
de: Kein @Published nötig — alle Properties automatisch beobachtbar

source: No renamed files in history
de: Keine umbenannten Dateien in der History

source: No scheme selected.
de: Kein Schema gewählt.

# no_scheme_selected_all_found_xccrashpoint_files_will_be
source: No scheme selected – all found .xccrashpoint files will be processed.
de: Kein Schema gewählt – alle gefundenen .xccrashpoint Dateien werden verarbeitet.

source: No schemes found in the project.
de: Keine Schemes im Projekt gefunden.

# no_stash_entries
source: No stash entries available
de: Keine Stash-Einträge vorhanden

source: No stashes available.
de: Keine Stashes vorhanden.

source: No subdirectories
de: Keine Unterverzeichnisse

source: No Swift files found.
de: Keine Swift-Dateien gefunden.

source: No SwiftLint issues found.
de: Keine SwiftLint-Probleme gefunden.

source: No tags available.
de: Keine Tags vorhanden.

source: No temporary leftovers found.
de: Keine temporären Altlasten gefunden.

source: No timing data found in xcresult.
de: Keine Timing-Daten im xcresult gefunden.

source: No TODO/FIXME/HACK comments.
de: Keine TODO/FIXME/HACK Kommentare.

source: No unmerged branches found
de: Keine ungemergten Branches gefunden

source: no update
de: kein Update

source: no username set
de: kein Name gesetzt

source: No username set — please enter one now.
de: Kein Benutzername gesetzt — bitte jetzt eingeben.

source: no writing
de: kein Schreiben

# no_xcassets_found
source: No .xcassets files found
de: Keine .xcassets-Dateien gefunden

# no_xccrashpoint_files_found_for_scheme_var
source: No .xccrashpoint files found for scheme '\(selectedScheme)'.
de: Keine .xccrashpoint Dateien für Schema '\(selectedScheme)' gefunden.

# no_xccrashpoint_files_found_in_the_apple_organizer
source: No .xccrashpoint files found in the Apple Organizer directories.
de: Keine .xccrashpoint Dateien in den Apple-Organizer-Verzeichnissen gefunden.

source: No Xcode project found.
de: Kein Xcode-Projekt gefunden.

source: No .xcresult found.
de: Kein .xcresult gefunden.

source: No .xcresult found in DerivedData.
de: Kein .xcresult in DerivedData gefunden.

source: No xcresult found. Please run tests first (option 1–3).
de: Kein xcresult gefunden. Bitte zuerst Tests ausführen (Option 1–3).

# no_xcstrings_found
source: No .xcstrings file found
de: Keine .xcstrings-Datei gefunden

source: Non-isolated
de: Nicht-isolierte

source: Non-isolated @Published Updates
de: Nicht-isolierte @Published Updates

source: Not available.
de: Nicht verfügbar.

source: Not available for macOS apps.
de: Nicht verfügbar für macOS-Apps.

# not_available_for_macos_apps_mock_status_bar_only_works_in
source: Not available for macOS apps. Mock Status Bar only works in the iOS Simulator.
de: Nicht verfügbar für macOS-Apps. Status Bar mocken funktioniert nur im iOS-Simulator.

source: Not available for macOS apps. Please use System Settings.
de: Nicht verfügbar für macOS-Apps. Bitte Systemeinstellungen verwenden.

# not_available_for_macos_apps_reset_status_bar_only_works_in
source: Not available for macOS apps. Reset Status Bar only works in the iOS Simulator.
de: Nicht verfügbar für macOS-Apps. Status Bar zurücksetzen funktioniert nur im iOS-Simulator.

source: not installed
de: nicht installiert

source: Not Merged Branches
de: Nicht gemergter Branches

source: not Optional
de: nicht Optional

source: Not referenced in code
de: Nicht im Code referenziert

source: not used in code
de: im Code nicht verwendet

source: Notarization
de: Notarisierung

source: Notarization history
de: Notarisierungs-Historie

# notarizes_an_ipa_or_dmg_with_apple_notarytool_xcrun
source: Notarizes an IPA or DMG with Apple notarytool (xcrun notarytool submit --wait). Required for macOS apps outside the App Store.
de: Notarisiert eine IPA oder DMG mit Apple notarytool (xcrun notarytool submit --wait). Erforderlich für macOS-Apps außerhalb des App Stores.

# note_debug_release_not_applicable
source: Note: Debug/Release does not differ – crashes occur at runtime regardless of the build configuration.
de: Hinweis: Debug/Release unterscheidet sich nicht – Crashes entstehen zur Laufzeit unabhängig von der Build-Konfiguration.

# note_heuristic_public_types_top_level_declarations_are
source: Note: Heuristic — public types/top-level declarations are searched.
de: Hinweis: Heuristik — öffentliche Typen/Top-Level-Deklarationen werden gesucht.

# nothing_staged
source: Nothing staged — index is empty
de: Nichts staged — Index ist leer

source: NotificationCenter Usage
de: NotificationCenter-Nutzung

# notificationcenter_usages_detail
source: NotificationCenter usages …
de: NotificationCenter Verwendungen …

source: NSLog calls
de: NSLog-Aufrufe

source: NSLog Usages
de: NSLog Verwendungen

# nslog_usages_2
source: NSLog Usages
de: NSLog-Verwendungen

# nslog_usages_detail
source: NSLog usages …
de: NSLog Verwendungen …

source: Number = navigate folder / open file in editor
de: Nummer = Ordner wechseln / Datei im Editor öffnen

source: Number to show (empty = skip):
de: Nummer anzeigen (leer = überspringen):

source: @objc Usage
de: @objc-Verwendung

source: @objc usages
de: @objc Verwendungen

# objc_usages_detail
source: @objc usages …
de: @objc Verwendungen …

# observableobject_candidates_for_observable_migration_ios17_detail
source: ObservableObject candidates for @Observable migration (iOS 17+) …
de: ObservableObject-Kandidaten für @Observable Migration (iOS 17+) …

source: ObservableObject classes
de: ObservableObject-Klassen

# observableobject_classes_without_published_detail
source: ObservableObject classes without @Published …
de: ObservableObject-Klassen ohne @Published …

source: ObservableObject without @Published
de: ObservableObject ohne @Published

source: occurrences
de: Stellen

source: Of which Test Files
de: Davon Test-Dateien

source: old signature
de: alte Signatur

source: .onChange old signature
de: .onChange alte Signatur

# onchange_old_signature_2
source: onChange old signature
de: onChange alte Signatur

# onchange_old_signature_ios17_detail
source: .onChange with old signature (changed in iOS 17) …
de: .onChange mit alter Signatur (iOS 17 geändert) …

source: One level up
de: Eine Ebene höher

source: open
de: offen

source: Open App Data Folder
de: App-Daten Ordner öffnen

# open_app_title
source: Open
de: Öffne

source: Open Apps
de: Apps öffnen

source: Open Deep Link
de: Deep Link öffnen

source: Open Instruments
de: Instruments öffnen

source: Open Project
de: Projekt öffnen

source: Open Simulator App
de: Simulator-App öffnen

# open_the_project_in_xcode_and_verify_that_schemes_exist_and
source: Open the project in Xcode and verify that schemes exist and are shared.
de: Öffne das Projekt in Xcode und prüfe, ob Schemes vorhanden und shared sind.

source: Open Xcode
de: Xcode öffnen

source: Open Xcode Organizer
de: Xcode Organizer öffnen

source: Opened.
de: Geöffnet.

# opens_a_url_deep_link_in_the_simulator_xcrun_simctl_openurl
source: Opens a URL / deep link in the simulator (xcrun simctl openurl). Tests URL schemes like myapp://screen/detail.
de: Öffnet eine URL / Deep Link im Simulator (xcrun simctl openurl). Testet URL-Schemes wie myapp://screen/detail.

# opens_apple_instruments_the_profiling_tool_for_memory_leaks
source: Opens Apple Instruments — the profiling tool for memory (Leaks, Allocations), CPU usage and more.
de: Öffnet Apple Instruments — das Profiling-Tool für Speicher (Leaks, Allocations), CPU-Auslastung und mehr.

# opens_the_app_data_container_of_the_selected_app_in_finder
source: Opens the app data container of the selected app in Finder (Documents, Caches, UserDefaults).
de: Öffnet den App-Daten-Container der gewählten App im Finder (Dokumente, Caches, UserDefaults).

source: Opens the application.
de: Öffnet die Anwendung.

# opens_the_detected_xcworkspace_or_xcodeproj_in_the_current
source: Opens the detected .xcworkspace or .xcodeproj in the current directory directly in Xcode.
de: Öffnet das erkannte .xcworkspace oder .xcodeproj im aktuellen Verzeichnis direkt in Xcode.

# opens_the_simulator_app_and_boots_the_selected_device_if_no
source: Opens the Simulator app and boots the selected device. If no device is selected, the Simulator app opens without a specific device.
de: Öffnet die Simulator-App und bootet das gewählte Device. Falls kein Device gewählt ist, wird die Simulator-App ohne spezifisches Gerät geöffnet.

# opens_xcode_navigate_to_window_organizer
source: Opens Xcode and automatically navigates to the Organizer window.
de: Öffnet Xcode und navigiert automatisch zum Organizer-Fenster.

source: Opens Xcode without a specific project.
de: Öffnet Xcode ohne ein spezifisches Projekt.

source: Operation aborted.
de: Vorgang abgebrochen.

source: or
de: oder

# organizer_crashes_description
source: .xccrashpoint files are crash packages that Xcode stores locally on the Mac when synchronizing crash reports via the Xcode Organizer. They are not ZIP archives, but macOS packages (bundles) containing an internal directory tree with the actual crash files. This tool extracts the actual crash files (.crash, .ips) from the packages and places them organized in a configurable target directory – for reading, archiving, and further processing. Export (Menu item 1): • Searches .xccrashpoint files in Apple Organizer directories • Filters by the currently selected scheme • Extracts the contained crash files • Sorts them by app, version, and build • Can be repeated at any time – existing files are skipped, new files are added Browse structure (Menu item 2): • Starts in the currently configured target directory • Displays subfolders and files clearly • Allows navigation into subfolders and one level back • Crash files can be opened directly in macOS editor Crash target path (Hotkey C in main menu): • Shows the currently configured target directory • Default: Desktop/Organizer/Crashes • Can be changed via C) at any time • The selected path is saved permanently • After a path change, simply run the export again to build the structure in the new directory Scheme assignment: • The currently selected scheme (S) determines which crash files are considered • If no scheme is selected, all found .xccrashpoint files are processed • If no files are found, a clear message appears
de: .xccrashpoint Dateien sind Crash-Pakete, die Xcode beim Synchronisieren von Crash-Reports über den Xcode Organizer lokal auf dem Mac ablegt. Sie sind keine ZIP-Archive, sondern macOS-Pakete (Bundles) die einen internen Verzeichnisbaum mit den eigentlichen Crash-Dateien enthalten. Dieses Tool extrahiert diese eigentlichen Crash-Dateien (.crash, .ips) aus den Paketen und legt sie geordnet in einem konfigurierbaren Zielverzeichnis ab – zum Lesen, Archivieren und Weiterverarbeiten. Export (Menüpunkt 1): • Sucht .xccrashpoint Dateien in den Apple-Organizer-Verzeichnissen • Filtert anhand des aktuell gewählten Schemas • Extrahiert die enthaltenen Crash-Dateien • Legt sie sortiert nach App, Version und Build ab • Kann beliebig oft wiederholt werden – vorhandene Dateien werden übersprungen, neue Dateien werden ergänzt Struktur durchsuchen (Menüpunkt 2): • Startet im aktuell konfigurierten Zielverzeichnis • Zeigt Unterordner und Dateien übersichtlich an • Erlaubt Navigation in Unterordner und eine Ebene zurück • Crash-Dateien können direkt im macOS-Editor geöffnet werden Crash-Zielpfad (Hotkey C im Hauptmenü): • Zeigt das aktuell konfigurierte Zielverzeichnis an • Standard: Desktop/Organizer/Crashes • Kann über C) jederzeit geändert werden • Der gewählte Pfad wird dauerhaft gespeichert • Nach einer Pfadänderung einfach den Export erneut ausführen, um die Struktur im neuen Verzeichnis aufzubauen Schema-Zuordnung: • Das aktuell gewählte Schema (S) bestimmt, welche Crash-Dateien berücksichtigt werden • Falls kein Schema gewählt ist, werden alle gefundenen .xccrashpoint Dateien verarbeitet • Falls keine Dateien gefunden werden, erscheint ein klarer Hinweis

source: orientation accesses
de: orientation-Zugriffe

source: .orig backup files
de: .orig Backup-Dateien

source: Output:
de: Ausgabe:

source: Output folder
de: Ausgabe-Ordner

source: Output name (without .xcframework)
de: Ausgabe-Name (ohne .xcframework)

source: outside
de: außerhalb

source: outside View struct
de: außerhalb View-Struct

# over_50_lines
source: >50 lines
de: >50 Zeilen

source: override without super
de: override ohne super

source: override without super call
de: override ohne super-Aufruf

# override_without_super_call_lifecycle_methods_detail
source: override without super call (lifecycle methods) …
de: override ohne super-Aufruf (Lifecycle-Methoden) …

# overrides_the_status_bar_in_the_simulator_ideal_for_clean
source: Overrides the status bar in the simulator — ideal for clean App Store screenshots (09:41, full battery, full signal).
de: Überschreibt die Statusbar im Simulator — ideal für saubere App Store Screenshots (09:41, voller Akku, volles Signal).

source: Overview
de: Übersicht

source: Overviews & Reports
de: Übersichten & Reports

source: Own Commits
de: Eigene Commits

source: package
de: Paket

source: Package Dependencies
de: Paket-Abhängigkeiten

# package_dependencies_description
source: Analyzes Package.swift and Package.resolved
de: Analysiert Package.swift und Package.resolved

source: packages
de: Pakete

source: Packages resolved.
de: Packages aufgelöst.

source: Passed
de: Bestanden

source: Passed Tests
de: Bestandene Tests

source: Path to .app / binary (DerivedData empty)
de: Pfad zur .app / Binary (DerivedData leer)

source: Path to .app file
de: Pfad zur .app Datei

# path_to_app_file_2
source: Path to .app file
de: Pfad zur .app-Datei

source: Path to .app/.ipa file
de: Pfad zur .app/.ipa-Datei

source: Path to binary or .dSYM
de: Pfad zum Binary oder .dSYM

source: Path to .crash file
de: Pfad zum .crash File

source: Path to .docc catalog
de: Pfad zum .docc Katalog

source: Path to .dSYM (empty = auto-search)
de: Pfad zum .dSYM (leer = automatisch suchen)

source: Path to .dSYM file
de: Pfad zur .dSYM Datei

source: Path to .dSYM file (or empty = search in DerivedData)
de: Pfad zur .dSYM Datei (oder leer = aus DerivedData suchen)

source: Path to image or video file
de: Pfad zur Bild- oder Videodatei

source: Path to .ipa
de: Pfad zur .ipa

source: Path to .ipa / .dmg
de: Pfad zur .ipa / .dmg

source: Path to .ipa file
de: Pfad zur .ipa-Datei

source: Path to .mobileprovision file
de: Pfad zum .mobileprovision File

source: Path to .xcarchive
de: Pfad zum .xcarchive

source: Path to .xcframework
de: Pfad zum .xcframework

source: per file
de: pro Datei

source: per func
de: pro Func

# performs_clean_build_and_shows_a_summary_with_duration
source: Performs clean + build and shows a summary with duration, error count and warnings.
de: Führt clean + build durch und zeigt danach eine Zusammenfassung mit Dauer, Fehleranzahl und Warnungen.

source: Period
de: Zeitraum

source: periphery not found. (brew install periphery)
de: periphery nicht gefunden. (brew install periphery)

source: Photo permission
de: Foto-Permission

source: Photo/Video to Gallery
de: Foto/Video in Galerie

source: Physical Devices
de: Physische Geräte

source: Physical Devices (devicectl)
de: Physische Geräte (devicectl)

# pickaxe_search
source: Pickaxe Search (term in diff)
de: Pickaxe-Suche (Begriff in Diff)

source: placeholders
de: Platzhalter

source: ← please enter!
de: ← bitte eingeben!

source: Please export crash files first.
de: Bitte zuerst Crash-Dateien exportieren.

source: ← please select!
de: ← bitte wählen!

source: Please select a device first using D).
de: Bitte zuerst mit D) ein Device auswählen.

source: Please select a scheme first using S).
de: Bitte zuerst mit S) ein Schema auswählen.

source: possibly unused files
de: möglicherweise ungenutzte Dateien

source: potential credentials
de: potenzielle Credentials

source: potential cycles
de: potenzielle Zyklen

source: Potential Retain Cycles
de: Potenzielle Retain Cycles

source: PR Summary
de: PR-Zusammenfassung

source: Pre-Build Checks
de: Basischecks vor Build

# press_enter_to_stop_recording_detail
source: Press \(Color.bold)Enter\(Color.reset) to stop recording …
de: Drücke \(Color.bold)Enter\(Color.reset) um die Aufnahme zu stoppen …

source: prevents SwiftUI diff
de: verhindert SwiftUI-Diff

source: Preview documentation
de: Dokumentation vorschauen

source: Preview documentation in browser
de: Dokumentation im Browser vorschauen

source: Preview server at http://localhost:8080 —
de: Vorschau-Server auf http://localhost:8080 —

# previewprovider_deprecated_since_ios_17_detail
source: PreviewProvider (deprecated since iOS 17) …
de: PreviewProvider (deprecated seit iOS 17) …

source: PreviewProvider occurrences
de: PreviewProvider Stellen

source: Previous Month
de: Vorheriger Monat

source: Previous Week
de: Vorherige Woche

source: print() Calls
de: print()-Aufrufe

# privacy_manifest_required_since_ios174
source: Required for the App Store since iOS 17.4 / Xcode 15.3. All four keys must be present.
de: Seit iOS 17.4 / Xcode 15.3 für den App Store Pflicht. Alle vier Keys müssen vorhanden sein.

source: Processing
de: Verarbeite

# prod_files
source: Production files
de: Produktionsdateien

source: Project:
de: Projekt:

source: Project Analysis
de: Projekt-Analyse

source: Project Files & Assets
de: Projekt-Dateien & Assets

source: Project Maintenance
de: Projektpflege

source: Project Metrics
de: Projekt-Metriken

# project_metrics_aggregated
source: Aggregated project metrics …
de: Aggregierte Projekt-Metriken …

# project_metrics_description
source: Aggregates all project metrics: lines, classes, structs, enums, functions, dangerous operations, and averages.
de: Aggregiert alle Metriken des Projekts: Zeilen, Klassen, Structs, Enums, Funktionen, gefährliche Operationen und Durchschnittswerte.

source: Project Metrics (Overview)
de: Projekt-Metriken (Gesamtübersicht)

source: Project Overview
de: Projekt-Übersicht

source: Property Wrappers
de: Property Wrapper

# property_wrappers_description
source: Counts all SwiftUI and Combine property wrappers in the project
de: Zählt alle SwiftUI- und Combine-Property-Wrapper im Projekt

source: Protocols
de: Protokolle
